# ProductCode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..ProductCode Property
FabricationAncillaryUsage Class See Also
---
A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public string ProductCode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductCode As String
	Get
```

Visual C++
---
```text
public:
property String^ ProductCode {
	String^ get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace